content/about/_index.md
+++
title = "About"
author = ["lockbox"]
description = "About lockbox"
draft = false
toc = false
+++

Interested in systems programming, and quadcopters.


## Programming {#programming}

For work i primarily program in `rust` and `c`, and for hobbiy stuff im currently messing around a lot with `zig` and `dafny`.

## Quadcopter {#quadcopter}

My main quad is based on [Joshua Bardwell DIY V2](<https://www.getfpv.com/freestyle-beginner-diy-drone-kit-joshua-bardwell-edition-v2-hd.html>) with some
different motors, props, and custom firmware for the flight controller based on [betaflight](<https://github.com/betaflight/betaflight>).
